In [78]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings 
warnings.filterwarnings('ignore')

In [79]:
data=pd.read_csv('covid_worldwide.csv')

In [80]:
df=data.copy()

In [81]:
df

,Serial Number,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Test,Population
0,1,USA,"104,196,861","1,132,935","101,322,779","1,741,147","1,159,832,679","334,805,269"
1,2,India,"44,682,784","530,740","44,150,289","1,755","915,265,788","1,406,631,776"
2,3,France,"39,524,311","164,233","39,264,546","95,532","271,490,188","65,584,518"
3,4,Germany,"37,779,833","165,711","37,398,100","216,022","122,332,384","83,883,596"
4,5,Brazil,"36,824,580","697,074","35,919,372","208,134","63,776,166","215,353,593"
...,...,...,...,...,...,...,...,...
226,227,Diamond Princess,712,13,699,0,NaN,NaN
227,228,Vatican City,29,NaN,29,0,NaN,799
228,229,Western Sahara,10,1,9,0,NaN,"626,161"
229,230,MS Zaandam,9,2,7,0,NaN,NaN
230,231,Tokelau,5,NaN,NaN,5,NaN,"1,378"

In [82]:
df['Country'].duplicated

<bound method Series.duplicated of 0                   USA
1                 India
2                France
3               Germany
4                Brazil
             ...
226    Diamond Princess
227        Vatican City
228      Western Sahara
229          MS Zaandam
230             Tokelau
Name: Country, Length: 231, dtype: object>

In [83]:
df.head(5)

,Serial Number,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Test,Population
0,1,USA,"104,196,861","1,132,935","101,322,779","1,741,147","1,159,832,679","334,805,269"
1,2,India,"44,682,784","530,740","44,150,289","1,755","915,265,788","1,406,631,776"
2,3,France,"39,524,311","164,233","39,264,546","95,532","271,490,188","65,584,518"
3,4,Germany,"37,779,833","165,711","37,398,100","216,022","122,332,384","83,883,596"
4,5,Brazil,"36,824,580","697,074","35,919,372","208,134","63,776,166","215,353,593"

In [84]:
df.shape

(231, 8)

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 231 entries, 0 to 230
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Serial Number    231 non-null    int64
 1   Country          231 non-null    object
 2   Total Cases      231 non-null    object
 3   Total Deaths     225 non-null    object
 4   Total Recovered  210 non-null    object
 5   Active Cases     212 non-null    object
 6   Total Test       213 non-null    object
 7   Population       228 non-null    object
dtypes: int64(1), object(7)
memory usage: 14.6+ KB

# Dealing with String Values

In [86]:
df['Total Cases'] = df['Total Cases'].str.replace('\,', '', regex=True)

In [87]:
df['Total Deaths'] = df['Total Deaths'].str.replace('\,', '', regex=True)

In [88]:
df['Total Recovered'] = df['Total Recovered'].str.replace('\,', '', regex=True)

In [89]:
df['Active Cases'] = df['Active Cases'].str.replace('\,', '', regex=True)

In [90]:
df['Total Test'] = df['Total Test'].str.replace('\,', '', regex=True)

In [91]:
df['Population'] = df['Population'].str.replace('\,', '', regex=True)

In [93]:
df.head(1)

,Serial Number,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Test,Population
0,1,USA,104196861,1132935,101322779,1741147,1159832679,334805269

In [92]:
df['Total Cases']=df['Total Cases'].astype(int)

In [96]:
df['Total Deaths']=df['Total Deaths'].astype(float)

In [99]:
df['Total Recovered']=df['Total Recovered'].astype(float)

In [108]:
df['Active Cases']=df['Active Cases'].astype(float)

In [109]:
df['Total Test']=df['Total Test'].astype(float)

In [110]:
df['Population']=df['Population'].astype(float)

In [111]:
df.dtypes

Serial Number        int64
Country             object
Total Cases          int32
Total Deaths       float64
Total Recovered    float64
Active Cases       float64
Total Test         float64
Population         float64
dtype: object

# Analysis

In [107]:
df['Total Deaths'].mean()

30057.777777777777

In [112]:
df['Total Cases'].mean()

2923460.0173160173

In [113]:
df['Total Recovered'].mean()

2993905.1285714284

In [122]:
df['Active Cases'].mean()

90998.84905660378

In [125]:
df['Total Test'].mean()

32493160.42253521

In [126]:
df['Population'].mean()

28493261.978070177

In [116]:
df['Total Deaths'].fillna(30058,inplace=True)

In [120]:
df['Total Recovered'].fillna(2993905,inplace=True)

In [123]:
df['Active Cases'].fillna(90999,inplace=True)

In [127]:
df['Total Test'].fillna(32493160,inplace=True)

In [128]:
df['Population'].fillna(28493262,inplace=True)

In [129]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 231 entries, 0 to 230
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Serial Number    231 non-null    int64
 1   Country          231 non-null    object
 2   Total Cases      231 non-null    int32
 3   Total Deaths     231 non-null    float64
 4   Total Recovered  231 non-null    float64
 5   Active Cases     231 non-null    float64
 6   Total Test       231 non-null    float64
 7   Population       231 non-null    float64
dtypes: float64(5), int32(1), int64(1), object(1)
memory usage: 13.7+ KB

In [ ]:
d